{
  "intents": [
    {"tag": "greeting",
     "patterns": ["Hi there", "Is anyone there?","Hey","Hola", "Hello", "Good day", "Hey", "Ekse", "Hi"],
     "responses": ["Hi", "How can I help", "Ey watsupp",  "Hola", "Hey dude", "Good to see you again"]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Ok bye", "Bye Bye", "Nice chatting to you, bye",  "Till next time","I got to go now", "I gotta go", "I'll get back to you", "It's been nice to talk to you", "alright bye", "appreciate the chat, bye",  "bye bye take care" ],
     "responses": ["See you!", "Have a nice day", "Sure Bye", "Later dude","Peace out", "Bye dude", "Take care","asta la vista"]
    },
	{"tag": "how_are_you",
     "patterns": ["How are you", "Hope you are good", "hope you're good", "Hope youre good", "How are you doing", "Hope you are fine", "How are you", "Are you ok","How are you doing", "Is everything alright", "Are you good" ],
     "responses": ["I'm good, thanks.", "I'm fine, thanks for asking.", "I'm good and happy to talk to you.", "I'm fine and happy, as always.","I'm cool, thanks for asking.", "I'm good dude. Thanks for asking.", "I'm okay, thanks.","I'm OK"]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You are welcome", "Sure dude"]
    },
    {"tag": "noanswer",
     "patterns": [],
     "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "I am still here dude"]
     },
     {"tag": "wrong",
      "patterns": ["This_is_not_the_right_image","wrong image"],
      "responses": ["<span style='color:red;'><b>This is not an image of emergency light! Kindly send the right image.<b></span>"]
      },
       {"tag": "name",
      "patterns": ["What is your name", "Whats your name", "Tell me your name", "Who are you", "Tell me about yourself", "You are"],
      "responses": ["I am CarBot", "My name is CarBot", "You can call me CB for short", "I am CarBot, my friends call me CB", "CarBot is my name"]
      },
      {"tag": "options",
       "patterns": ["What do you do", "What do you know", "What is your purpose", "What are your features?", "What you can do?", "What are you abilities", "can you talk"],
       "responses": ["I can help you diagnose your car issues. I take pictures of emergency lights and diagnose your car issues too", "I can help you diagnose your car faults. Ask or send a picture","If you have a car fault, I'm your guy. Just tell me the emrgency situation or send a picture and you're safe", "I can guide you through your car issues if you tell me the emergency state. Chat or Picture"]
      },
       {"tag": "help",
       "patterns": ["I need a hand", "my car broke down","How can you help","my car has fault","my car is faulty","my vehicle broke down","I need help", "I need some help", "I need you help me now", "I need you right now", "I need you to do something for me", "I need you to help me", "I want your help", "assistance", "do me a favor", "could you give me a hand", "help me", "help me out", "help me with a problem", "help me with that", "help us", "will you help me", "you help me"],
       "responses": ["Tell me about your car issue or send picture of emergency light so I can help you.", "What's up? Tell me about your car issue or send picture of emergency light","I'm glad to help. Tell me about your car issue or send picture of emergency light"]
      },
     {"tag": "abs",
      "patterns": ["ABS light", "ABS","ABS System", "ABS light is ON", "Anti-lock Brake System Light is ON", "AntiLock Brake System", "Anti Lock Brake System", "Anti Lock Brake"],
      "responses": ["This means that there is a problem with the car’s anti-lock brake system. <br> An anti-lock brake system, ABS, is a system which is designed to prevent you from locking up your brakes, or applying so much pressure to your brakes that the axle and your wheels themselves stop turning completely. <br> When your wheels stop turning but your car is still moving too fast, you start to skid, and skidding causes you to lose total control over your vehicle, which is a dangerous prospect when traveling at high speeds. <br>ABS light can be on due to the following: <br> weather (below 40 degrees)<br> Low tire pressure <br> Low brake fluid, etc.<br>Note: Worn-out brake pads don’t cause ABS light to come on<br><br>Is the ABS status light on steadily or  ABS status light  is flashing?"]
      },
      {"tag": "abs_steady",
       "patterns": ["The ABS status light is on steadily ", " ABS status light is on steadily ", " ABS light is on steadily ", "ABS light is  steady ", "steady ABS light", "ABS light steadily", "ABS status light is steadily ", "ABS is on steadily ", " ABS status light is on steady "],
       "responses": ["<b>The ABS status light is on steadily</b>.<br>An ABS indicator light on your dash is a sign that something may have gone wrong with your system and you need to get it checked out. The four common reasons that typically cause this light to turn on include.<br><b>1. A blown fuse</b><br>ABS fuse functions like other electrical systems. The fuse protects the ABS system and can blow if there is an electrical surge. Check the fuse, if it’s blown, replace it with a new fuse. If the fuse blows again, then there is a short circuit in the ABS system, check the pump motor or ABS computer. <br>The fuse is found in the fuse panel underneath the dashboard or under the hood in the power distribution center. <br><b>2. Low brake fluid</b><br>The abs light on the dashboard is a sign that either the brake fluid escaped from the system through a leak or evaporation, or that the fluid level dropped but wasn’t picked up by the sensor. In case the brake fluid level drops and the abs light comes on and off, then the sensor needs replacing as it’s defective. <br><b>3. Broken wheel speed sensors</b><br><b>4. The system is turned off.</b>"]
        },
      {"tag": "abs_safe",
       "patterns": ["Is it safe to drive a car with ABS light on?", " can I drive a car with ABS light on", " Is it good to drive a car with ABS light on", " Can one drive a car with ABS light on", " driving a car with ABS light on?"],
       "responses": ["It is Safe To Drive Carefully With The ABS Light On. But Get It Looked At Quickly. You can still drive the car with your ABS light on, because it does not impact normal braking. However, I wouldn't recommend you do this because your ABS system helps to control stopping, and it can be dangerous to be driving without it."]
      },
      {"tag": "abs_fail",
       "patterns": ["What causes ABS to fail ", " Why is my ABS failing ", "What is the cause of abs problem", "Abs problem","Why did my ABS fail ", "My ABS has failed", " ABS has failed ", " My ABS failed", "ABS failed"],
       "responses": ["The most common ABS problems occur when sensors become contaminated with debris or metal shavings. Malfunctions also occur when sensor wiring becomes damaged, resulting in intermittent or no continuity. ABS rarely malfunction unless the ABD controller is malfunctioning because of one or more sensors or faulty sensor wiring. The most common cause is the contamination of sensors by corrosion, debris, or metal shavings. You will only notice a failure the moment you slam the brakes and notice the wheels are locking up as you drive. "]
      },
      {"tag": "abs_how_much",
       "patterns": ["how much does it cost to fix the ABS system ", "how much to fix the ABS system ", " how much ABS", " how much does it cost to fix the ABS", " cost to fix the ABS", " how much is ABS"],
       "responses": ["It will cost approximately £150 if you factor in the cost for ABS diagnosis and labor costs. However, the estimate doesn’t include taxes and fees and varies depending on your location.However, if you have to replace the ABS system, you can pay an additional fee of £200-750 depending on the ABS module part. Many garages will fix your ABS for between £270-900 in total."]
      },
     {"tag": "battery_charge",
      "patterns": ["Battery light flashing ", "Battery Charge", "Battery light", " Battery", " Battery flashing"],
      "responses": ["<b>This is the Battery Charge light</b><br>. This indicates a battery charging problem. <br> The battery light on your car dashboard signals a charging problem with your car battery. If the light turns and stays on, it might be that your alternator isn’t generating enough voltage to charge it. Common causes can be a broken alternator belt, damaged battery cells or a failed alternator.<br>If the light comes on and stays on while driving, this means that your alternator is running solely on energy stored in the battery. If you continue driving, your battery will eventually drain and your vehicle will stop working.<br><b> Security Level:<span style='color:red;'> High</span></b><br>You should immediately turn off everything electrical in your vehicle except for the headlights in order to conserve whatever charge is left in the battery. This includes the air conditioning, heating, stereo, interior lights, heated seats/mirrors, phone chargers and bluetooth accessories. "]
},
 {"tag": "battery_on_why",
       "patterns": ["why is my battery light on","Why is the battery light ON", "The battery light is on", "Why is the battery warning light ON"],
       "responses": ["Here are some possible reasons why the battery warning light is ON <br>Bad or faulty battery<br>Bad Alternator<br>Bad Alternator Belt<br>Corroded Battery Terminals<br>Loose Battery Cable<br>Bad Battery Cable<br>Bad Ground Strap<br>Faulty Wiring"]
      },
      {"tag": "operate_battery_on",
       "patterns": ["Why does my car operate with the battery light on", "my car operate with the battery light on ", "Why does my car work with the battery light on", " car working with the battery light on"," my car moves with the battery light on"],
       "responses": ["If your battery light stays on and your car seems to operate normally, you need to head to a mechanic. Your vehicle is draining the energy left in the battery and it will die fairly soon."]
      },
      {"tag": "bad_alternator",
       "patterns": ["bad alternator ", " bad alternator  or dead battery", " How do you tell if it's a dead battery or bad alternator ", " dead battery or bad alternator"],
       "responses": ["If your vehicle has a dead battery, it may not start or may have difficulty starting, have dimmed or flicking lights or an issue with the sound system. If it stalls while you’re driving or your engine turns off suddenly, the alternator is malfunctioning or not recharging your battery."]
      },
      {"tag": "battery_fix",
       "patterns": ["How do I fix the battery light on my dashboard ", " fix the battery light on my dashboard ", " fix the battery light ", " How do I fix the battery light"],
       "responses": ["Try turning off all the lights and other systems that can drain your battery. If the problem persists, stop the vehicle and let it cool for a while. If it still doesn’t work, drive straight to your mechanic to have them take a look."]
      },
     {"tag": "Check_engine",
      "patterns": ["Check Engine light flashing", "Check Engine", "Check Engine light is ON", "Shape of a silhouetted engine", "ECU warning light ", " Check Engine light", " Check Engine flashing"],
 "responses": ["<b>This is the Check Engine light</b><br>. This light is one the most ambiguous because it relates to anything having to do with the car's motor and emissions system. The potential issue could be as minor as a loose wire,  an ill-fitting gas cap, or worn solenoid. Or it could mean something far more serious is wrong in the heart of the engine itself. <br><b> Security Level:<span style='color:red;'> Medium - High</span></b> <br> Misfires on one or several cylinders (most common) <br> Causes of a flashing or blinking Check Engine Light:<br> 1. Misfires on one or several cylinders (most common) <br> 2 Faulty spark plugs/Coils.<br>3. Faulty Faulty engine sensors (coolant, air temperature, exhaust temperature sensor, etc.)<br> 4. Faulty EGR valve <br> 5. Faulty/bad injectors<br>6. Faulty crankshaft/camshaft sensor<br><br>Is the Check Engine status light is on steadily  or  the Check Engine status light is flashing?"]
      },
      {"tag": "check_engine_steady",
       "patterns": ["The Check Engine status light is on steadily ", " Check Engine status light is on steadily ", " Check Engine light is on steadily ", " Check Engine light is  steady ", "steady Check Engine light", " Check Engine light steadily", " Check Engine status light is steadily ", " Check Engine is on steadily ", "Check Engine status light is on steady "],
       "responses": ["<b> The Check Engine status light is on steadily </b>.<br> If the light is on steadily and there's no loss of power. You should get it checked as soon as possible." ]
      },
      {"tag": "check_engine_flashing",
       "patterns": ["The Check Engine status light is flashing", " Check Engine status light is flashing ", "Check Engine light is flashing ", " Check Engine light  flashing", " The Check Engine light is flashing "],
       "responses": ["<b> Check Engine status light is flashing </b><br> If it's flashing while you're driving. Avoid heavy acceleration and high engine speed. Stop the vehicle when it's safe to do so. Restart the engine after 2 minutes to reset the engine management system. If the light's still flashing, turn off the engine and contact your specialist "]
      },
      {"tag": "check_engine_drive_how_long",
       "patterns": ["How long can I drive with my check engine light on?", "Can I continue driving with the check engine light on", "Is It Safe to Drive my Car With the Check Engine Light On"," Is it safe to drive a car with check engine light on?", " can I drive a car with check engine light on", " Is it good to drive a car with check engine light on", " Can one drive a car with check engine light on", " driving a car with check engine light on"],
       "responses": ["If the check engine light comes on you should get it checked as soon as you can, as by continuing to drive you risk causing further, potentially irreparable damage to your engine."]
      },
      {"tag": "car_noise",
       "patterns": ["The car is operating erratically.", " The car is making a strange noise.","The car is making a strange noise.", "The car is making noise.", "noisy car"],
       "responses": ["Pull over immediately and call for a tow. This means there’s a far more serious problem, such as a misfire that could permanently damage the car’s engine. Ignoring a blinking check-engine light could mean putting yourself at risk, and ruining your car’s powertrain."]
      },
      {"tag": " car_shaking ",
       "patterns": ["Why is my check engine light flashing and the car shaking ", " car shaking"],
       "responses": ["An engine misfire—a problem that almost always causes an increase in hydrocarbon emissions —is one of the many reasons why the check engine light might illuminate (or start to flash). Usually, when the check engine light is on and the car is shaking, that means you're dealing with an engine misfire."]
      },
{"tag": "dpf",
      "patterns": ["DPF light flashing", "DPF", "DPF light is ON", "Diesel Particulate Filter Light is ON", "Diesel Particulate Filter", "Diesel Particulate", "Diesel Particulate Filter", "Diesel Particulate Filter Light","dpf light", "dpf"],
 "responses": ["<b>This is the DPF light</b><br>. This means that there is a problem with the car’s diesel particulate filter.<br><b> Security Level:<span style='color:red;'> Medium</span></b> </br This needs to be addressed as it reduces the amount of airflow the car has to expel exhaust gases from the engine, which can cause a loss in power and eventually, other significant engine problems.<br><br>Is the DPF status light is on steadily  or  the DPF status light is flashing?"]
      },
  {"tag": "dpf_steady",
       "patterns": ["The DPF status light is on steadily ", " DPF status light is on steadily ", "DPF light is on steadily ", "DPF light is  steady ", "steady DPF light", "DPF light steadily", "DPF status light is steadily ", "DPF is on steadily ", "DPF status light is on steady "],
       "responses": ["<b> The DPF status light is on steadily </b>.<br> This is your first warning and you need to actively regenerate the diesel particulate filter <br> You can do this by increasing your speed to more than 40mph for between 10 and 15 minutes. This should allow the exhaust to reach sufficiently high temperatures to burn the soot and clear the filter.<br> During the regeneration, you may notice things like your engine making an unusual noise, a slightly pungent smell coming from the exhaust, and an increase in your fuel consumption. This should all return to normal once the active regeneration process has been completed. You should also see the DPF light go out.<br>If you cannot maintain a speed of more than 40mph for long enough to allow the regeneration process to complete, the soot will continue to build up in your filter and your DPF warning light will remain on until you have the problem fixed. " ]
      },
      {"tag": "srs",
       "patterns": ["Airbag/SRS", " Airbag", "Airbag SRS","SRS", "SRS light", " Airbag light", "SRS light  on", " Airbag light on"],
"responses": ["<b> The This is the SRS warning light.  </b>.<br> The SRS warning light refers to the Supplemental Restraint System (SRS) and is most commonly known as the a+irbag system light. <br><b> Security Level:<span style='color:red;'> High</span></b><br> SRS warning light indicates a malfunction in one of the three areas: the SRS airbag system, the front passenger occupant classification system or the seatbelt pretensioner system. If your airbag light comes on, we strongly suggest that you do not ignore it and contact your local Toyota dealer or mechanic as soon as possible. <br> If the SRS light is blinking or stays on, take it seriously. There is a fault condition and the vehicle’s safety systems are compromised, putting you and your passengers at risk.<br>Here are 5 reasons why the Airbag Light might show up on your Dashboard: <br>1. Faulty Sensors <br>2. Dead Backup Battery<br>3. Water Damage<br>4.  Seat Belt<br>5. A Small Collision"]
      },
      {"tag": "srs_on_drive",
       "patterns": ["Can I drive with the SRS light on", "Can I continue driving with the srs light on", "Is It Safe to Drive my Car With the srs Light On","Is it safe to drive a car with srs light on", " can I drive a car with srs light on", " Is it good to drive a car with srs light on", " Can one drive a car with srs light on", " driving a car with srs light on"],
       "responses": ["No, it's not safe. You need to visit or contact your mechanic as soon as possible."]
      },
       {"tag": "srs_exam",
       "patterns": ["How do I Examine the Passenger Airbag Switch", "Can I Examine the Passenger Airbag Switch", "Examine the Passenger Airbag","How do I Check the Passenger Airbag Switch"],
       "responses": ["The passenger seat airbag on/off button (only available in some cars) should be one of the first things to check when attempting to shut off the airbag light. It is possible that someone turned it off erroneously, causing the airbag light to stay on. This button is normally on the dashboard on the passenger side but is sometimes visible once you open the glove box or passenger door. "]
      },
       {"tag": "verify_passenger_seat",
       "patterns": ["How do I verify That the Passenger Seat Sensor Is Not Applied", "Can I verify That the Passenger Seat Sensor Is Not Applied", "verify That the Passenger Seat Sensor Is Not used","How do I Check that the Passenger Seat Sensor Is Not used"],
       "responses": ["Select vehicles have an overly sensitive passenger weight sensor. The trouble with these specific cars is that the sensors easily trip just by placing a large box or container on the passenger seat. As a result, the airbag light turns on. There are two options to address this – either remove the object from the passenger seat or hook up the seatbelt. If the latter solves the problem, it would confirm the sensor was applied, causing the airbag light to illuminate. If the airbag light turns off after fastening the seat belt, but nothing is in the seat, it would mean a faulty passenger seat sensor. You can then determine if you want to replace the sensor or keep the seat belt buckled up whenever you drive."]
      },
      {"tag": "Clock_Spring",
       "patterns": ["How do I fix Clock Spring", "Can I fix Clock Spring", "fix Clock Spring","Clock Spring"],
       "responses": ["To fix a Clock Spring, Follow these steps:<br>Step 1: Remove the negative battery cable from the terminal; Wait for the capacitors to discharge for at least 10-15 minutes. (Note that removing the car battery terminals by itself will not reset the airbag light). <br>Step 2: With the wheels straight, hold the wheel’s center section (the location of the airbag) in place and locate the screws. Then, unscrew them.<br>Step 3: Remove the airbag by pulling it towards you and remove the connectors (you may use a pick to slide the yellow clips out when doing this). Turning the steering wheel left to right also exposes the screws that hold the steering column trim in place.<br>Step 4: With the steering lock engaged, use two pieces of painter’s tape to mark the spot between the steering wheel and steering column trim. This reference point will come in handy when returning the steering wheel to its original position later on.<br>Step 5: Loosen the steering wheel nut with a breaker bar without removing it completely. <br>Step 6: Remove the nut and wheel once the wheel is loose, exposing the clock spring.<br>Step 7: To remove the clock spring, disconnect the harnesses at the bottom or back. Replace the old one with a new clock spring. Break the tab off by bending it until it snaps.<br>Step 8: Refer to your tape marks to line up the steering wheel properly when reinstalling.<br>Step 9: Tighten the steering column nut to the specified torque with a torque wrench (or your hands and a breaker bar); Install the harnesses along with the airbag.<br>Step 10: Reinstall the lower steering column trim piece and reconnect the negative battery terminal. You should no longer have a flashing airbag light when done with this final step."]
      },  
    
{"tag": "brake",
      "patterns": ["Parking brake light flashing ", " brake light", " brake", " brake flashing", "Brake System","My brake light is blinking"],
      "responses": ["<b>This is the Brake System light</b><br>. This means that there is a problem with the car’s brake system. <br> The parking brake, also known as the hand brake and emergency brake is used to secure your vehicle when stopped or parked. When applied, the ‘P’ symbol illuminates on the dashboard, usually in red but depending on the make and model of vehicle, it may light up in yellow or orange. The parking brake light should go out when the brake is released. If the parking brake light stays on or intermittently flickers when driving when you have disengaged the brake, there are some faults within the system."]
},
 {"tag": "red_brake_on_why",
       "patterns": ["why is my red brake light on","Why is the red brake light ON", "The red brake  light is on", "Why is the red brake  warning light ON", "red brake"],
       "responses": ["A red light that flashes on and off could signal low/almost empty brake fluid, but also a serious issue with the brake's hydraulic system. If the light comes on and stays on, you could end up with a potentially catastrophic (and costly) brake failure. Also, If after checking for leaks the brake warning light remains on, it may indicate an issue with your brake pads. If your brake pads have become significantly worn, this may trigger the light."]
      },
     
      {"tag": "brake_on_drive",
       "patterns": ["Why does my car operate with the brake light on", "my car operate with the brake light on ", "Why does my car work with the brake light on", " car working with the brake light on"," my car moves with the brake light on", "Why is the parking brake light on while driving?"],
       "responses": ["It illuminates to show that the parking brake or emergency brake is engaged and must be released before driving. If it remains lit after the parking brake is released or if it turns on and off intermittently while you're driving, it means you need to add brake fluid."]
      },
      {"tag": "brake_steady",
       "patterns": ["The DPF status light is on steadily ", " DPF status light is on steadily ", "DPF light is on steadily ", "DPF light is  steady ", "steady DPF light", "DPF light steadily", "DPF status light is steadily ", "DPF is on steadily ", "DPF status light is on steady "],
       "responses": ["<b> The DPF status light is on steadily </b>.<br> This is your first warning and you need to actively regenerate the diesel particulate filter <br> You can do this by increasing your speed to more than 40mph for between 10 and 15 minutes. This should allow the exhaust to reach sufficiently high temperatures to burn the soot and clear the filter.<br> During the regeneration, you may notice things like your engine making an unusual noise, a slightly pungent smell coming from the exhaust, and an increase in your fuel consumption. This should all return to normal once the active regeneration process has been completed. You should also see the DPF light go out.<br>If you cannot maintain a speed of more than 40mph for long enough to allow the regeneration process to complete, the soot will continue to build up in your filter and your DPF warning light will remain on until you have the problem fixed. " ]
      },
       {"tag": "brake_fine_on",
       "patterns": ["Why is my brake light on but brakes work fine", "brake light on but brakes work fine", "my brake light is on but brake works", "my brake light is on but brakes is fine"],
       "responses": ["Defective Sensors – Sensors located in the brake master cylinder measuring brake fluid or the parking brake sensor may fail, prompting the brake light to come on. An expert on brake repair should be able to identify the sensor that has caused the light to come on and replace it." ]
      },
        {"tag": "eps_on",
       "patterns": ["Electric Power Steering light flashing", "EPS", "EPS light is ON", "Electric Power Steering Light is ON", "Electric Power Steering","Power Steering","Power Steering Light", "Electric Power steering warning light","Power Steering light", "Power Steering" ],
       "responses": ["This means that there is a problem with the car’s Electric Power Steering or the car’s Power Steering fluid level is low.<br>Severity Level: High<br>For vehicles with hydraulic power steering, the most common reason for the power steering warning light is that the fluid level is low. This is often caused by a leak in one of the hoses.<br>If you’re driving along and you notice your power steering light come on – which looks like a steering wheel with an exclamation mark next to it – you should park your car in a safe place as soon as you can, taking extra care as you’ll be struggling a little with much heavier steering.<br>Open your bonnet and locate your steering wheel fluid reservoir. This may have an image of a steering wheel on the cap. If not, you may need to consult your owner’s handbook to help you find where it is.<br>Have a look at the fluid level. If it looks a little low, you’ll need to top up the reservoir with more fluid before you continue on your journey. You probably won’t have any to hand so you’ll have to pop to your local supplier to pick some up.<br>Once you’ve topped up your power steering fluid, start your engine. If the warning light doesn’t come on again, you may continue on your journey. If the power steering light remains illuminated, it’s the sign of something more serious and you should take your car to your local garage as soon as possible to have the problem diagnosed.<br> So what is the next step?<br>If this happens, it is best to pull over once it is safe and investigate.<br>If you drive a car with a hydraulic power steering system, you should check the fluid level by locating the steering wheel fluid reservoir within the engine. It may be marked with a steering wheel on the cap and should have a marked fluid level. If the level is low, you should top it up with the correct fluid as indicated in your car's manual. Upon starting the engine again, the light should remain dark.<br>Remember that a low fluid level is often a result of a leak in the system and should be evaluated by a specialist as soon as possible.If your car operates with an electronic system, it may be worthwhile to turn your car on and off again. If this does not solve the problem, you should check that all the connections to your car's battery are correct and undamaged." ]
      },
      {"tag": "eps_safe",
       "patterns": ["Is it safe to drive a car with power steering light on?", " can I drive a car with power steering  light on", " Is it good to drive a car with power steering  light on", " Can one drive a car with power steering  light on", " driving a car with power steering  light on?"],
       "responses": ["It’s not going to be easy, as the steering will be heavier and turning will be more difficult. It will also be almost impossible to react to events at higher speeds, so accidents will be far more likely.<br>If the light comes on when you’re near home, you’re probably alright to continue your journey safely, taking extra care, however, if you’re far from home we would recommend that you stop as soon as possible and inspect your car in a safe place.<br>Either way, the steering wheel warning light can be a clear sign that something is wrong with your power steering system and you should have your car inspected by a qualified technician as soon as possible."]
      },
      {"tag": "eps_on_why",
       "patterns": ["why is my Power Steering light on","Why is the Power Steering  light ON", "The Power Steering light is on", "Why is the Power Steering  warning light ON"],
       "responses": ["Here are some possible reasons why the Power Steering  warning light is ON: <br>1.  Low Power Steering Fluid<br>2.  Leaks<br>3. Electrical Errors<br>Corroded Battery Terminals<br>Loose Battery Cable<br>Bad Battery Cable<br>Bad Ground Strap<br>Faulty Wiring"]
      },
       {"tag": "eps_battery",
       "patterns": ["Can a bad battery make the EPS light to come on?","Can a faulty battery make the EPS light come on?","Can a bad battery affect the EPS?"],
       "responses": ["Yes, it can sometimes be caused by a fault with the battery or alternator, so you can carefully check all connections to the battery and see if there’s any visible wear or damage. This issue with the EPS light can also be caused if you have recently had to jump-start your car, or you’ve disconnected the battery."]
      },
       {"tag": "eps_heat",
       "patterns": ["Can excessive heat affect my EPS?"," Can excessive heat affect the Electronic Power Steering?"," Can too much heat affect the EPS?"," Can too much heat affect the Electronic Power Steering?"],
       "responses": ["Yes! In the case of excessive heat, the electric power steering system might fail."]
      },
      {"tag": "eps_fluid",
       "patterns": ["Can low fluid  affect my EPS?"," Can low fluid affect the Electronic Power Steering?"," Can low fluid affect the EPS?"," Can low fluid affect the Electronic Power Steering?"],
       "responses": ["No! If you have an electric power steering system, the light will not come on to warn you of low fluid levels since there is no power steering fluid being used. In some cases, restarting the engine might be all that you need to do to turn the light off. Sometimes, small errors can happen, which cause the car’s computer to think that there is an issue where there isn’t."]
      },
        {"tag": "high_temp",
       "patterns": ["HIGH ENGINE COOLANT TEMPERATURE light flashing", "High Engine Coolant Temperature", "HIGH ENGINE COOLANT TEMPERATURE light is ON", "Engine Coolant Light is ON", "High Temperature", "Engine Overheating", "Engine is over-heating", "Engine temperature is too hot", "Engine is too hot", "Engine temperature is very high" ],
       "responses": ["Engines overheat for many reasons. Generally, cars overheat because of a problem with the cooling system that doesn’t allow heat to leave the engine compartment. This is often due to a leak or blockage somewhere in the engine cooling system or other components. Other sources may be from a faulty or broken water pump or radiator fan, or from a clogged coolant hose.<br> Is the High Engine Coolant Temperature light onsteadily or not?" ]
      },
      {"tag": "temp_safe",
       "patterns": ["Is it safe to drive a car with high coolant temp", "Can I drive with a high engine coolant temperature", "Can I drive while my car is overheating"],
       "responses": ["Find a safe place to pull over. <br>Driving your car when it's overheating can cause serious – and sometimes permanent – damage to your engine, so it's best to stop driving as soon as possible. Pull over and away from oncoming traffic, then turn off the engine"]
      },
      {"tag": "temp_cause",
       "patterns": ["Common reasons for overheating engines","Why is the engine overheating","Why is the temperature high","Why is my car overheating", "My car is overheating","My car’s temperature is very high"],
       "responses": ["There are a variety of reasons why a vehicle’s engine can overheat. Certain examples may be quicker fixes, such as refilling your antifreeze, but other issues may be more permanent if not properly taken care of by a professional<br>Below are common factors that can cause a car to overheat:<br>1. Too little or no coolant<br>2. Cooling system leaks<br>3. A broken water pump<br>4. Radiators issues<br>5. Oil too low<br>6. Thermostat failure<br>7. Issues with the belts and hoses  <br>8. Heater core is plugged up<br>Prolonged Stalling<br>Excess Load<br>Hot Weather <br><br> What to do:<br>1. Pull over and assess the situation<br>2. Keep moving only if necessary<br>3. Turn on the heat<br>4. Open all the windows<br>5. Call for assistance<br><br>It only takes 30-60 seconds of overheating for permanent damage to infiltrate a vehicle. As soon as you notice signs of overheating, you need to act.<br><br> To prevent this from happening next time:<br>1. Keep your car cool in the summer by parking in the shade and using sun screens to keep your interior cool.<br>2.  Keep an eye on your temperature gauge and coolant levels, adding coolant whenever necessary to a cool engine, and letting your car cool down if needed.<br>3.  Carry extra coolant in your car so you’re able to fill up your fluid levels as and when needed.<br>4.  Get the air flowing by opening windows and floor vents to let warm air escape the cabin and help keep your car’s temperature down.<br>5.  Check your car in with a mechanic to have your cooling system flushed out and cleaned. Mechanics recommend having this done every 40,000 miles."]
      },
     
      {"tag": "temp_steady",
       "patterns": ["The HIGH ENGINE COOLANT TEMPERATURE status light is on steadily ", " HIGH ENGINE COOLANT TEMPERATURE status light is on steadily ", "HIGH ENGINE COOLANT TEMPERATURE light is on steadily ", "ABS light is  steady ", "steady HIGH ENGINE COOLANT TEMPERATURE light", "ABS light steadily", "HIGH ENGINE COOLANT TEMPERATURE status light is steadily ", "HIGH ENGINE COOLANT TEMPERATURE is on steadily", "HIGH ENGINE COOLANT TEMPERATURE status light is on steady "],
       "responses": ["<b>The HIGH ENGINE COOLANT TEMPERATURE status light is on steadily.</b>"]
        },
        {"tag": "gasket_repair",
       "patterns": ["How to repair a Blown Head Gasket","How do I repair my gasket is blown","repairing a blown gasket","How to fix a Blown Head Gasket","How do I fix my gasket is blown","fixing a blown gasket"],
       "responses": ["To repair a blown gasket, please follow the steps below.<br>Step 1: Disconnect the negative battery terminal, located at the top of the car battery.<br>Step 2: Remove the intake hose and airbox.<br>Step 3: Take off the air conditioner compressor; this will require you to remove several bolts. Once the compressor is free, lay the device on its side in order to access the cylinder head.<br>Step 4: Disconnect the water pump hose, by using a screwdriver to loosen the clamp.<br>Step 5: Remove the alternator. You won’t need to take off the entire alternator harness; simply remove the bolts.<br>Step 6: Drain the radiator and remove the radiator hoses. Disconnect all the lines running to the air conditioner.<br>Step 7: The head gasket should now be visible. Refer to your service manual and pay close attention to the tightening sequence for the head bolts that hold the head gasket in place, as these must be loosened in the correct reverse order.<br>Step 8: Remove the old blown head gasket. Be sure to thoroughly clean the cylinder head, so that the new head gasket sits correctly.<br>Step 9: Once you have fitted the new head gasket into the space, tighten the bolts again in the correct order.  You’ll need a torque wrench to do so, as the bolts must be torqued to a specific tightness, relevant to your particular vehicle. It’s crucial that these bolts are torqued correctly, as otherwise you may cause damage to your new head gasket.<br>Step 10: Replace the components. Reconnect the hoses in the order in which you disconnected them, replace the alternator, and ensure that all necessary parts are once again in place.<br>Step 11: Fill the cooling system with fresh coolant and turn on the engine, allowing it to idle until it reaches operating temperature. Allow the engine to run for several minutes before switching it off and checking your new head gasket for any leaks."]
        },
         {"tag": "radiator_flush",
       "patterns": ["How Do You Flush a Radiator?","How do I flush my radiator","How to flush a radiator"],
       "responses": ["To flush your radiator, take these steps:<br>Step 1: Your engine must be cool. Don’t attempt to open the petcock or radiator with a warmed engine. Before performing any work, tap on the radiator to ensure it’s cool.<br>Step 2: Put your vehicle on jack stands so you can access the bottom of the radiator. Place your container underneath.<br>Step 3: Open the petcock to drain all of the coolant.<br>Step 4: Once it is drained, close the petcock. Now, fill the reservoir with water. Run the engine for a few minutes.<br>Step 5: Run the engine for a few minutes so the water circulates. The engine shouldn’t get too warm.<br>Step 6: You need to drain the radiator a second time.<br>Step 7: You want to repeat this flush a couple of times.<br>Step 8: Once all of the bad coolant is flushed from the engine; you can fill the system with fresh coolant."]
        },
        {"tag": "radiator_leak",
       "patterns": ["How Do You Seal a Leaky Radiator?","How can I seal a leaky radiator?","My radiator is leaking, How can I fix it?","How can I repair my radiator?"],
       "responses": ["If you find a leak, there are ways to seal it. Try these steps to see if any work for you.<br>Step 1: Begin by replacing a leaky radiator cap. This is probably the easiest fix you might need.<br>Step 2: Apply a commercial sealant. This isn’t a permanent fix but merely helps you stop the leak or slow it down long enough to get repairs. Make sure the engine is cool before you pour it in the radiator. Make sure the coolant is topped off.<br>Step 3: Use two-part adhesive for small cracks. If you see the crack, you might be able to use some two-part adhesive. Make sure you clean the area first. Then, cover the entire crack with two-part adhesive and let it dry overnight before running the car."]
        },
        {"tag": "radiator_replace",
       "patterns": ["Steps to Replace a Radiator.","How to replace a faulty Radiator.","How can I replace my radiator?"],
       "responses": ["If you plan to replace the radiator yourself, these are the steps you will want to follow.<br>(Tools required: Safety glasses, Air compressor, Flare nut wrench, Vacuum fill tool, Repair manual, Jack, Jack stands, Protective gloves, Pliers, Sockets and ratchets, Ratchet extension, Wrenches, Screwdriver)<br><br>Prepare the Vehicle<br>Step 1: Raise your vehicle and provide proper support. Use jack stands in the front and wheel chocks in the rear. Don’t forget to apply the parking brake.<br>Step 2: Drain all of the coolant out of the radiator into an approved container. Remove the car’s lower radiator hose or open the petcock valve.<br>Step 3: Remove the reservoir hose. You can loosen the hose clamp with a screwdriver or pliers, depending on the design. Then, twist the hose and pull it away from your radiator.<br>Step 4: Use your pliers or screwdriver to disconnect the upper radiator hose.<br>Step 5: Take off the lower radiator hose. Use your screwdrivers or pliers and then pull it away from the connection.<br>Step 6: Push in the tab and pull back to disconnect the cooling fan electrical connector.<br>Step 7: Take off the cooling fan mounting bolts with a socket, ratchet and extension.<br>Step 8: Take off your cooling fan.<br>Step 9: Use your flare nut wrench to remove the transmission cooler lines from the radiator.<br>Step 10: Remove the mounting bolts on the radiator. Use your socket and ratchet or wrench.<br><br>Replacing the Radiator<br>Step 1: Take out the radiator.<br>Step 2: Mount your new radiator in the same position.<br>Step 3: Install the radiator mounting bolts. Tighten them down.<br>Step 4: Use a flare nut wrench to connect the transmission cooler lines to the radiator.<br>Step 5: Mount the cooling fan and install the bolts.<br>Step 6: Install the cooling fan connector.<br>Step 7: Connect the lower radiator hose and tighten.<br>Step 8: Connect the upper radiator hose and tighten: Bleed the air out of the system through the bleeder valve, by using a cooling system vacuum fill tool or by running the engine while the radiator cap is off.<br>Step 9: Attach the radiator reservoir hose and tighten.<br>Step 10: Fill your radiator with fresh coolant according to manufacturer specs. Make sure the drain petcock is closed before filling.<br>Step 11: Bleed the air out of the system through the bleeder valve, by using a cooling system vacuum fill tool or by running the engine while the radiator cap is off. Each car has a different procedure, so make sure you check your repair manual for complete instructions.<br>Step 12: Lower your vehicle.<br>Step 13: Make sure you always recycle your coolant at a local shop."]
        },
        {"tag": "radiator_maintain",
       "patterns": ["Maintain a Radiator?","How to maintain my radiator?", "Maintaining a radiator?","How can I maintain my radiator?"],
       "responses": ["Every car has a maintenance schedule offered by the manufacturer. To care for your system, you want to replace the coolant typically between 25,000 to 40,000 miles. This prevents issues with coolant delivery.<br>As soon as you notice any trouble with the engine temperature, you want to have the radiator inspected. It’s possible to repair the tank, flush old coolant, replace leaking hoses or swap out the entire radiator."]
        },
        {"tag": "low_fuel",
       "patterns": ["LOW FUEL light flashing", "Low Fuel", "LOW FUEL light is ON", "FUEL Light is ON", "FUEL TANK WARNING LIGHT", "FUEL TANK LIGHT", "LOW PETROL"],
       "responses": ["This means there is low fuel.<br>Severity Level: Low<br>The low fuel warning light has one purpose: to tell drivers that their fuel tanks are running low. If the yellow fuel pump symbol turns on, you need to drive to a gas station and fill up your fuel tank.<br>Your car’s driveability isn’t affected, and you can still drive safely. Just don’t plan on going for too long—you don’t want to find yourself out of fuel and stranded.<br>Aside from the risk of running entirely out of gas, you shouldn’t make a habit of driving with the low fuel warning light on. Your fuel pump needs fuel to act as a lubricant and coolant. When you run low (below a quarter tank), the fuel pump is no longer submerged, and you risk wearing it out faster."]
        },
        {"tag": "how_much_fuel",
       "patterns": ["How much reserve fuel does my car have?","How much fuel is left in my car when operating on reserve?", "How much fuel is left in my car", "how o Inkniw how much fuel left"],
       "responses": ["The fuel gauge in your car or truck is lying to you. Automobile manufacturers build in about a gallon (3.8 liters) of reserve fuel beyond the 'empty' line. They also warn about low fuel long before a vehicle runs out, since they know that people procrastinate — especially when it comes to forking over money."]
        },
        {"tag": "drive_fuel",
       "patterns": ["How long can I drive on reserve?","How many Kilometer can I drive on reserve?","How many km can I drive on reserve?","How many miles can I drive on reserve?","How long can I drive with low fuel","How many Kilometer can I drive with low fuel? How many km can I drive with low fuel? How many miles can I drive with low fuel"],
       "responses": ["When you see the low petrol light appear on the digital dashboard, you will have an autonomy of around 40-60 kilometer (31 miles), in the case of vans and bigger sizes cars, having a bigger tank, you will be able to do up to 70 to 80 miles while on low fuel."]
        },
        {"tag": "turn_off_fuel",
       "patterns": ["How to turn off your dashboard low fuel warning light", "How do I turn off your dashboard low fuel warning light", "turn off dashboard low fuel warning light", "turn off yourlow fuel warning light"],
       "responses": ["Topping off your fuel tank at the nearest gas station should turn off your low fuel warning light.<br>If your light stays on even when your fuel tank is full, your fuel level sensor could need servicing. Try using a higher grade fuel. Lower grades have more impurities or could contain traces of water that may damage your sensor.<br>If you are still having problems, it would be a good idea to take your car to a mechanic. Your mechanic will inspect your sensor for problems and either clean or replace the sensor. Your mechanic also may check your fuel tank for defects."]
        },
        {"tag": "mwl",
       "patterns": ["MASTER WARNING light flashing", "MASTER WARNING LIGHT","Master System Warning", "MASTER WARNING  light is ON", "MASTER Light is ON" ],
       "responses": ["The master warning light means the following:<br>A message that’s available to read<br>An incorrectly performed operation has been carried out<br>The vehicle is in need of maintenance<br>A minor or serious fault has been detected<br>The master warning light may also be accompanied by an additional warning light or an audible alert, but will always come on with a message describing what the problem is.<br><br>The master warning light comes on for the following reasons:<br>1.  Master warning light comes on with audible alert<br>Both the master warning light (non-flashing) and audible alert indicates an important situation, for example; when a driving related system is malfunctioning or that danger may result if the correction procedure is not performed.<br>2.  Master warning light flashes with audible alert<br>A flashing master warning light and audible alert indicates an urgent situation that may result in damage to the vehicle or danger to passenger occupants. Generally a flashing master warning light and audible alert is considered the most urgent.<br>3.  Master warning light comes on, audible alert does not sound<br>The master warning light comes on (non-flashing) and the audible alert does not sound indicating  a possible malfunction of electrical components or the need for vehicle maintenance.<br>4.  Master warning light flashes, audible alert does not sound<br>Indicates a situation, such as when an operation has been performed incorrectly, or indicates how to perform an operation correctly.<br><br>What to o if the Master Warning Light Comes On:<br> Master warning light should always be accompanied by a message. Read the message and follow the instructions on the multi-information display. If after carrying out the instructions the warning light comes back on, contact a Toyota workshop.<br>Additionally, look to see if any other warning lights have come on along with the master warning light."]
        },
        {"tag": "oil_pressure",
       "patterns": ["OIL PRESSURE light flashing", "Oil Pressure", "OIL PRESSURE light is ON", "ENGINE OIL Light is ON", "ENGINE OIL PRESSURE", "Engine Oil Shortage", "Flashing Engine Oil Pressure Light" ],
       "responses": ["This is about the engine oil.<br>Severity Level: High <br>When the oil warning light comes on, it is a sign that the engine oil pressure has dropped to a low level, which is dangerous. An engine running with low oil pressure can quickly destroy the engine.<br>The oil pressure gauge should read somewhere between 25 to 65 PSI while the engine is running. Should it start creeping higher (think 80+ PSI), then you've got yourself a problem with high oil pressure.<br><br>Symptoms of Low Engine Oil Pressure:<br>- Oil Warning Light. If the oil pressure drops below an appropriate level, your sensor may activate your oil warning light on the dashboard.<br>- Diminishing Engine Performance.<br>- Burning Oil Smell. <br>- Engine Noise. <br>- Engine Overheating.<br>- Low Engine Oil. <br>- Incorrect Oil Viscosity.<br>- Bad Oil Pump."]
        },
        {"tag": "oil_drive_on",
       "patterns": ["Is it safe to drive a car with oil pressure light on?", "can I drive a car with oil pressure light on", " Is it good to drive a car with oil pressure light on", " Can one drive a car with oil pressure light on", " driving a car with oil pressure light on?"],
       "responses": ["If you're driving along and your oil warning light comes on, take it very seriously. This indicates that your car may be unsafe to drive. Your auto's engine has lost oil pressure, or the oil level is too low. When the warning light comes on, pull over as soon as possible and shut off the engine"]
      },
      {"tag": "oil_pressure_on_why",
       "patterns": ["why is my oil pressure  light on","Why is the oil pressure light ON", "The oil pressure light is on", "Why is the oil pressure warning light ON"],
       "responses": ["Here are the possible reasons why the Oil Pressure Light is ON.<br>- Not enough or worn-out oil – Maintenance on any vehicle is key to keeping it on the road. An oil change should always be on your to-do list every 3-6 months or between 3,000 – 5,000 miles. This ensures you’ll always have clean, fresh oil circulating through your engine.<br>- Engine wear – Oil moves throughout the engine through the crankshaft bearing and the camshaft bearings. If the area has broadened because of worn parts, oil flows too easily reducing oil pressure. The oil pump must force oil through narrow areas under bearings and passageways. These are the areas that build pressure in the system because they control the rate of flow. The faster the engine moves, the higher the flow rate and pressure.<br>- Faulty Oil Pressure Gauge – Your engine may have plenty of oil in the pan and it may be perfectly fine, but the trouble lies within the oil pressure gauge. Electrical issues and trouble with the wiring can cause the gauge to malfunction and produce a false reading. A technician will need to perform a mechanical oil pressure test to determine whether there is a lack of pressure or not.<br>- Clogged or Dirty Air Filter – Oil filters play a key role in maintaining oil pressure. If the filter becomes clogged, it will increase the pressure and reduce the flow. A pressure relief valve on the oil filter prevents the pressure from getting too high. If it’s damaged, it won’t be able to do its job, allowing engine oil to flow more easily, reducing pressure.<br>- Oil Viscosity – Higher viscosity oil is thicker and doesn’t flow as quickly as thinner oil. This affects the oil pressure depending on the time of year. High viscosity oil prevents oil pressure from building rapidly.<br>- Engine Overheating – An overheating engine is not just a headache for the driver. It’s hard on the engine as it causes the oil to thin, preventing pressure build up. It has a similar effect as using a lower viscosity oil than the vehicle requires.<br>- Faulty Oil Pump – While not as common, a faulty oil pump may create wider passageways between the rotors causing a drop in the rate of flow.<br>- Worn Out Internal Components – Each component in the engine contributes to the combustion process. When these components fail, the oil may unintentionally enter the combustion chamber and get burned, resulting in a drop in the engine oil level and pressure. This is easily recognized as it often produces a blue smoke that exits through the tailpipe."]
      },
      
      {"tag": "dirty_oil",
       "patterns": ["How do I know if my oil is dirty?","Is my engine oil dirty?","dirty oil","dirty engine oil"],
       "responses": ["Check for dirty oil the same way you check your oil level—examining the oil on the dipstick. Clean oil should be transparent, an amber-like color, and a bit runny. If your oil looks super dark, has a funny smell, or is thick and sludgy to the touch, it's probably old and should be changed.<br><br> How the engine oil gets dirty:<br>As it runs through the engine, it can pick up dirt, dust, and small debris, causing gunk to build up. While you might still have the correct amount of oil in your car, the blockage can trigger your oil light."]
      },
      {"tag": "bad_oil_sensation",
       "patterns": ["IS MY OIL PRESSURE SENSOR BAD?","Is my oil pressure sensor faulty?","oil pressure sensor bad"],
       "responses": ["Your oil pressure sensor is a small plug-like sensor that monitors your vehicle's oil pressure and notifies you if it drops below a certain limit. But like everything else in your car, it can wear out, which could send faulty signals that trigger your oil light.<br>To check if your oil pressure sensor is worn out, the sensor needs to be removed using an oil pressure sensor socket. Unless you have the tools and the expertise to do it yourself, have an expert technician troubleshoot your oil pressure sensor"]
      },
       {"tag": "oil_fix",
       "patterns": ["How do I fix Low Oil Pressure", " fix Low Oil Pressure", " fix Low Oil Pressure", " How do I fix Oil Pressure","Low Oil Pressure Fixes."," How can I fix the Low Oil Pressure?"," Can I fix the low oil pressure?"],
       "responses": ["1.  If the oil level is low, add oil to the engine to bring the level up to the FULL mark on the dipstick. DO NOT overfill the crankcase. Use the type of oil viscosity specified in the vehicle owner's manual.<br>2.  If the oil pressure gauge reading remains low or the oil pressure warning light remains on, remove the oil pressure sending unit on the engine and connect a pressure gauge directly to the engine. <br>3.  Start the engine to see if the pump is generating adequate pressure. <br>4.  If pressure is normal (about 10 PSI for every 1000 RPMs of engine speed, the problem is not a bad oil pump, but a faulty oil pressure sending unit. Replace the oil sending unit.<br>5.  If you do not have a pressure gauge for testing oil pressure, try replacing the oil pressure sending unit with a new one. <br>6.  If the oil pressure warning light goes out or the gauge reading is now normal, you have fixed the problem. But if the warning light or low gauge reading continues, the problem is likely a bad oil pump.<br>7.  If the oil pump is bad (does not produce adequate pressure), the oil pump will have to be replaced. On many engines, the oil pump is located inside the oil pan on the bottom of the engine. The pan must be removed to replace the pump. This may require raising the engine and/or removing steering or suspension components that are in the way so the pan can be removed. <br>8.  On other engines, the oil pump is located inside the timing cover on the front of the engine. Disassembly requires removing most of the components on the front of the engine to access the pump. This type of pump is much more difficult and time consuming to replace.<br>9.  If oil pressure is low because of worn engine bearings, the crankshaft bearings will have to be replaced. This usually requires overhauling or replacing the engine."]
      },
      {"tag": "bad_oil_pump",
       "patterns": ["Bad Oil Pump?"," Is my Oil Pump bad?"," Is my oil pressure pump bad?"," How do I know if my oil pump is bad?"," Is my oil pump faulty?"," Faulty Oil Pump."," How do I know if my oil pressure pump is faulty?"],
       "responses": ["If the oil level is between ADD and FULL, and the engine was making noise when it was running, the problem may be a bad oil pump.<br>DO NOT run the engine until the problem can be repaired. Oil pressure can be checked by attaching a pressure gauge to the engine where the oil pressure sending unit is attached. If oil pressure is within specifications (typically 10 psi for every 1000 rpm) the oil pump is okay. <br>If pressure is less than specifications, the oil pump may be worn, or the engine bearings may be worn."]
      },
      {"tag": "tyre_pressure",
       "patterns": ["Tyre PRESSURE light flashing", "Tyre PRESSURE", "Tyre PRESSURE light is ON", "Tyre  Light is ON", "Tyre Pressure", "Tyre ", "Flashing Tyre  Pressure Light", "Tyre Warning Light", "Tyre Light", "Flat Tyre Light"],
       "responses": ["This means that there is a problem with one or more of your tyres.<br>Severity Level: Low<br>The purpose of the TPMS (Tyre Pressure Monitoring System) is to alert you when tire pressure is too low and could create unsafe driving conditions. If the light is illuminated, it means your tires could be underinflated, which can lead to undue tire wear and possible tire failure. It's important to understand the importance of proper tire inflation, and how TPMS can help you avoid a dangerous situation. Is the Tyre Pressure Light on steadily or the Tyre Pressure light flashes"]
        },
        {"tag": "tpms_steady",
       "patterns": ["The Tyre Pressure light is on steadily ", "Tyre Pressure light is on steadily ", "Tyre Pressure status light is on steadily ", "Tyre Pressure light is  steady ", "steady Tyre Pressure light", "Tyre Pressure light steadily", "Tyre Pressure status light is steadily ", "Tyre Pressure is on steadily ", "Tyre Pressure status light is on steady "],
       "responses": ["When the TPMS light comes on – and stays on – at least one of your tyres is at a low pressure level. Check the pressure of all of the tyres with a gauge and determine the cause of pressure loss and add air or service the tyre(s) as appropriate."]
        },
         {"tag": "tyre_flashing",
       "patterns": ["The Tyre Pressure status light is flashing", "Tyre Pressurestatus light is flashing ", "Tyre Pressure light is flashing ", "Tyre Pressure light  flashing", "Tyre Pressure light is flashing","TPMS LIGHT GOES ON AND OFF."," The Tyre Pressure Light goes on and off."," The Tyre pressure light is ON and OFF."," The tyre pressure is flashing."," The tyre Pressure light is blinking."," The tire pressure light is going on and off. "],
       "responses": ["When tire pressure(s) are near the level that triggers an alert, fluctuating temperatures may be causing your TPMS light to turn on and off. This typically occurs when pressure decreases overnight due to a drop in ambient temperature that causes the light to turn on; the light may turn off when pressure increases during the day due to rising ambient temperature and/or heat generated from driving the vehicle. Use a gauge to check the pressure of all of the tires and add air to any tire that is low<br><br>If the light flashes for approximately 60 to 90 seconds every time you start your car and then remains illuminated, this means the TPMS isn’t functioning properly and you should take it to an automotive service center for an inspection. Until repaired, the TPMS is out of order and is not able to warn you of low tire pressure. Check the air pressure of all of the tires with a gauge and add air to the tires that need it"]
      },
       {"tag": "tyre_safe",
       "patterns": ["Is it safe to drive a car with Tyre Pressure light on?", "can I drive a car with Tyre Pressure light on", " Is it good to drive a car with Tyre Pressure light on", " Can one drive a car with Tyre Pressure light on", " driving a car with Tyre Pressure light on?","Can I drive with the tyre warning light on?"," Can I drive while the TPMS light is ON?"," Can I keep on driving with the TPMS light?"," TPMS light is ON while driving."," Tyre Pressure light came on while I was driving."],
       "responses": ["Unless you have a completely flat tyre, yes you can continue to drive with the warning light on. But don't leave it too long before you follow the checking procedure. Driving with under-inflated tyres is definitely not recommended."]
      }
  ]
}
